# だ・である口調に変換

n = input()
n_2 = []

for i in range(len(n)):
    n_2.append(n[i])
for j in range(10):
    n_2.append('x')

for h in range(len(n)):
    if n_2[h] + n_2[h+1] + n_2[h+2] == "いです":
        n_2[h],n_2[h+1],n_2[h+2] = 'い',"",""
    elif n_2[h] + n_2[h+1] == "です":
        n_2[h],n_2[h+1] = 'だ',""
    elif n_2[h] + n_2[h+1] == "ので":
        n_2[h],n_2[h+1] = 'た','め'
    elif n_2[h] + n_2[h+1] + n_2[h+2] + n_2[h+3] + n_2[h+4] == "ませんでした":
        n_2[h],n_2[h+1],n_2[h+2],n_2[h+3],n_2[h+4], n_2[h+5] = 'な','か','っ','た',""
    elif n_2[h] + n_2[h+1] + n_2[h+2] == "でした":
        n_2[h],n_2[h+1],n_2[h+2] = 'だ','っ','た'
    elif n_2[h] + n_2[h+1] + n_2[h+2] == "ません":
        n_2[h],n_2[h+1],n_2[h+2] = 'な','い',""
    elif n_2[h] + n_2[h+1] + n_2[h+2] + n_2[h+3] == "でしょう":
        n_2[h],n_2[h+1],n_2[h+2],n_2[h+3] = 'だ','ろ','う',""
    elif n_2[h] + n_2[h+1] + n_2[h+2] + n_2[h+3] == "きました":
        n_2[h],n_2[h+1],n_2[h+2],n_2[h+3] = 'き','た',"",""
    elif n_2[h] + n_2[h+1] + n_2[h+2] + n_2[h+3] + n_2[h+4] == "なりました":
        n_2[h],n_2[h+1],n_2[h+2],n_2[h+3],n_2[h+4] = 'な','っ','た',"",""
    elif n_2[h] + n_2[h+1] + n_2[h+2] + n_2[h+3] + n_2[h+4] == "しまいます":
        n_2[h],n_2[h+1],n_2[h+2],n_2[h+3],n_2[h+4] = 'し','ま','う',"",""
    elif n_2[h] + n_2[h+1] + n_2[h+2] == "ります":
        n_2[h],n_2[h+1],n_2[h+2] = 'る',"",""
    elif n_2[h] + n_2[h+1] + n_2[h+2] + n_2[h+3] == "なります":
        n_2[h],n_2[h+1],n_2[h+2],n_2[h+3] = 'な','る',"",""
    elif n_2[h] + n_2[h+1] + n_2[h+2] + n_2[h+3] == "しました":
        n_2[h],n_2[h+1],n_2[h+2],n_2[h+3] = 'し','た',"",""
    elif n_2[h] + n_2[h+1] + n_2[h+2] == "ました":
        n_2[h],n_2[h+1],n_2[h+2] = 'た',"",""
    elif n_2[h] + n_2[h+1] + n_2[h+2] == "します":
        n_2[h],n_2[h+1],n_2[h+2] = 'し','た',""
    elif n_2[h] + n_2[h+1] + n_2[h+2] + n_2[h+3] == "思います":
        n_2[h],n_2[h+1],n_2[h+2],n_2[h+3] = '思','う',"",""
    elif n_2[h] + n_2[h+1] + n_2[h+2] == "います":
        n_2[h],n_2[h+1],n_2[h+2] = 'い','る',""
    elif n_2[h] + n_2[h+1] == "ます":
        n_2[h],n_2[h+1] = 'る',""
    elif n_2[h] + n_2[h+1] + n_2[h+2] + n_2[h+3] + n_2[h+4] == "でしょうか":
        n_2[h],n_2[h+1],n_2[h+2],n_2[h+3],n_2[h+4] = 'だ','ろ','う','か',""
    elif n_2[h] + n_2[h+1] + n_2[h+2] + n_2[h+3] + n_2[h+4] == "ありますか":
        n_2[h],n_2[h+1],n_2[h+2],n_2[h+3],n_2[h+4] = 'あ','る','だ','ろ',"うか"

for g in range(len(n_2)):
    if n_2[g] != 'x':
        print(n_2[g],end="")
